#N1
# მომხმარებლისგან ოთხი რიცხვის მიღება (მთელი რიცხვები)
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))
num3 = int(input("შეიყვანეთ მესამე რიცხვი: "))
num4 = int(input("შეიყვანეთ მეოთხე რიცხვი: "))

# ოთხი რიცხვის საშუალო არითმეტიკის გამოთვლა
რიცხვი = (num1 + num2 + num3 + num4) / 4

# შედეგის გამოქვეყნება
print("საშუალო არითმეტიკა:", რიცხვი)


#N2
saxeli = input("miutite sheni saxeli: ")
gvari = input("miutite sheni gvari: ")
full_name = saxeli + " " + gvari
print("mogesalmebit" + " " + full_name)



#N3
num1 = input("შეიყვანეთ პირველი რიცხვი: ")
num2 = input("შეიყვანეთ მეორე რიცხვი: ")

gaertianeba = num1 + " " + "😊" + " " + num2

print(gaertianeba)