#ახსენით რა განსხვავებაა immutable და mutable-ს შორის.
#   Immutable   (int)
x = 10
print("საწყისი მნიშვნელობა x =", x)
print("x-ის მეხსიერების მისამართი:", id(x))

# შევცვლოთ x-ის მნიშვნელობა
x = x + 5
print("\nშეცვლილი მნიშვნელობა x =", x)
print("x-ის ახალი მეხსიერების მისამართი:", id(x))

 
# int ტიპის ობიექტი არის immutable.
# როდესაც x-ს ვუცვლით მნიშვნელობას, რეალურად იქმნება ახალი ობიექტი,
# და x მიუთითებს ამ ახალ ობიექტზე.


#  Mutable   (list)
my_list = [1, 2, 3]
print("\nსაწყისი სია:", my_list)
print("სიის მეხსიერების მისამართი:", id(my_list))

# სიის შეცვლა
my_list.append(4)
print("\nდამატების შემდეგ სია:", my_list)
print("სიის მეხსიერების მისამართი კვლავ:", id(my_list))
 
# list ტიპის ობიექტი არის mutable.
# ელემენტის დამატებისას, მეხსიერების მისამართი არ იცვლება —
# იგივე ობიექტი რჩება, უბრალოდ შეიცვალა მისი შინაარსი.