tasks = []

#ფუნქცია, რომელიც აჩვენებს ამჟამად არსებულ დავალებებს
def show_tasks():
    if not tasks:  
        print("📭 დავალებები ჯერ არ არის.")
    else:
        print("\n📋 შენი დავალებები:")
        for i, task in enumerate(tasks):  #ყოველი დავალება იტერაციით
            print(f"{i + 1}. {task}")  #დავალებას ვაჩვენებთ ნომრით

#ამ ფუნქციის საშუალებბით ვამატებთ ერთზე მეტ დავალეაბას
def add_tasks():
    #მომხმარებელს ვთხოვთ შეიყვანოს დავალებები მძიმით გამოყოფილი
    input_text = input("✏️ ჩაწერე რამდენიმე დავალება (გამოყავი მძიმით): ")

    #ვყოფთ ტექსტს მძიმის მიხედვით, ვშლით ცარიელ ადგილებს და ვფილტრავთ ცარიელ სტრინგებს
    new_tasks = [task.strip() for task in input_text.split(",") if task.strip()]
    
    if new_tasks:  #თუ სიაში  დაემატა რამე
        tasks.extend(new_tasks)  #სიაში დავალებების ჩამატება
        print(f"✅ {len(new_tasks)} დავალება დაემატა.")  #ვაჩვენებთ რამდენი დავალება დაემატა
    else:
        print("⚠️ არაფერი დაგმატებულა.")  #თუ არაფერი ქინება დამატებული

#ფუნქცია, რომელიც შლის ერთ  დავალებას
def delete_task():
    show_tasks()  #გვაჩვენებს დავალებებს
    try:
        # მომხმარებელს შემოაქვა ნომერი რომელიც უნდა წაიშალოს 
        index = int(input("❌ რომელი წავშალოთ? (ნომერი): ")) - 1  # ინდექსი არის ნომერი - 1
        if 0 <= index < len(tasks):  #ვამოწმებთ იმდექსს
            removed = tasks.pop(index)  #შლის ფუნქციას
            print(f"🗑️ '{removed}' წაიშალა.")  #წაშლილი დავალების ჩვენება
        else:
            print("⚠️ არასწორი ოპრაცია.")  #თუ ოპერაცია არასწორია
    except ValueError:
        print("⚠️ გთხოვ შეიყვანე რიცხვი.")  #თუ არარიცხვითი მნიშვნელობა შეიყვანა

#მენიუ 
while True:
    print("\n📌 მენიუ:")
    print("1. დავალებების ნახვა")
    print("2. დავალების დამატება")
    print("3. დავალების წაშლა")
    print("0. გამოსვლა")

   
    choice = input("👉 აირჩიე ოპცია: ")

   
    if choice == "1":
        show_tasks() 
    elif choice == "2":
        add_tasks()  
    elif choice == "3":
        delete_task()  
    elif choice == "0":
        print("👋 ნახვამდის!")  
        break
    else:
        print("⚠️ არასწორი ოპერაციაა აირჩიე ნაჩვენები ოპერაციიდან.")  