#N1
# მომხმარებლის ასაკის შეყვანა
age = int(input("მიუთითეთ თქვენი ასაკი: "))

# ასაკის მიხედვით გადაწყვეტილების მიღება
if age <= 2:
    print("მოგიწევთ ბაღში წასვლა.")
elif age <= 6:
    print("მოგიწევთ ბაღში წასვლა.")
elif age < 18:
    print("მოგიწევთ სკოლაში წასვლა.")
else:
    print("მოგიწევთ სამსახურში წასვლა.")
    
 #N2
 # მომხმარებლის შესავალის მიღება
academy = input("რომელ პროგრამირების აკადემიაში დადიხარ? ")

# პირობების საფუძველზე შედეგის გამოსატანა
if academy == "Goa":
    print("U are a real chad!")
else:
    print("Join Goa, become a chad")

#N3
# მომხმარებლის მიერ პროექტში მიღებული ქულის შეყვანა
score = int(input("შეიყვანეთ თქვენი ქულა: "))

# ქულის მიხედვით შეფასების გაცემის ლოგიკა
if score > 90:
    print("შეფასება: A")
elif score > 75:
    print("შეფასება: B")
elif score > 60:
    print("შეფასება: C")
elif score > 50:
    print("შეფასება: D")
elif score > 40:
    print("შეფასება: E")
else:
    print("შეფასება: F")
